Documents/ВыплатаВебМастеру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыплатаВебМастеру</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчётыСВебМастерами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВебМастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВебМастера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыплатаВебМастеру/Ext/ManagerModule.bsl
Функция СформироватьПечатнуюФорму(ДокументСсылка) Экспорт
	
	Макет = Документы.ВыплатаВебМастеру.ПолучитьМакет("МакетВыплаты");
	ТабДок = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыплатаВебМастеру.Номер КАК Номер,
	|	ВыплатаВебМастеру.Дата КАК Дата,
	|	ВыплатаВебМастеру.ВебМастер КАК ВебМастер,
	|	ВыплатаВебМастеру.Сумма КАК Сумма,
	|	ВыплатаВебМастеру.Валюта КАК Валюта
	|ИЗ
	|	Документ.ВыплатаВебМастеру КАК ВыплатаВебМастеру
	|ГДЕ
	|	ВыплатаВебМастеру.Ссылка = &Ссылка";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Если Не Шапка.Следующий() Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	ВалютаПечати = Шапка.Валюта;
	Если Не ЗначениеЗаполнено(ВалютаПечати) Тогда
		ВалютаПечати = Константы.УправленческаяВалюта.Получить();
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Номер = Шапка.Номер;
	Область.Параметры.Дата = Формат(Шапка.Дата, "ДЛФ=D");
	Область.Параметры.ВебМастер = Шапка.ВебМастер;
	Область.Параметры.Сумма = Формат(Шапка.Сумма, "ЧДЦ=2");
	Область.Параметры.Валюта = ВалютаПечати;
	ТабДок.Вывести(Область);
	ТабДок.Вывести(Макет.ПолучитьОбласть("Подвал"));
	
	Возврат ТабДок;
	
КонецФункции
